Repository: jwsscott777/WeldHandbook
Catalog: WeldHandbook/Localization/Localizable.xcstrings
Source language: en
Languages: es_419, fil_ph, ht, pt_br, zh_hans

source: Polarity
es_419: Polaridad
ht: Polarite
pt_br: Polaridade
zh_hans: 极性

source: Position
es_419: Posición
fil_ph: posisyon
ht: pozisyon
pt_br: Posição
zh_hans: 位置

source: Power Source & Machine Type: GTAW operates with a Constant Current (CC) power source, much like the Shielded Metal Arc Welding (SMAW) process. This compatibility means that a machine suitable for SMAW can technically be converted to handle GTAW and vice versa. However, it's essential to check for the correct leads and connections, as not all GTAW machines come ready for stick welding. You'll typically find GTAW machines in two categories: Direct Current (DC) only or Alternating Current/Direct Current (AC/DC). Pure AC GTAW machines are exceptionally rare.
es_419: Fuente de energía y tipo de máquina: GTAW funciona con una fuente de energía de corriente constante (CC), muy similar al proceso de soldadura por arco metálico protegido (SMAW). Esta compatibilidad significa que una máquina adecuada para SMAW puede convertirse técnicamente para manejar GTAW y viceversa. Sin embargo, es fundamental comprobar que los cables y las conexiones sean correctos, ya que no todas las máquinas GTAW vienen preparadas para la soldadura con electrodo revestido. Normalmente encontrará máquinas GTAW en dos categorías: corriente continua (CC) únicamente o corriente alterna/corriente continua (CA/CC). Las máquinas Pure AC GTAW son excepcionalmente raras.
fil_ph: Pinagmulan ng Power at Uri ng Makina: Gumagana ang GTAW gamit ang Constant Current (CC) na pinagmumulan ng kuryente, katulad ng proseso ng Shielded Metal Arc Welding (SMAW). Ang pagkakatugma na ito ay nangangahulugan na ang isang makina na angkop para sa SMAW ay maaaring teknikal na ma-convert upang mahawakan ang GTAW at vice versa. Gayunpaman, mahalagang suriin ang mga tamang lead at koneksyon, dahil hindi lahat ng GTAW machine ay handa para sa stick welding. Karaniwang makikita mo ang mga GTAW machine sa dalawang kategorya: Direct Current (DC) lang o Alternating Current/Direct Current (AC/DC). Pambihira ang mga purong AC GTAW machine.
ht: Sous pouvwa & Kalite machin: GTAW opere ak yon sous kouran Constant Current (CC), anpil tankou pwosesis la Shielded Metal Arc Welding (SMAW). Konpatibilite sa a vle di ke yon machin apwopriye pou SMAW ka teknikman konvèti nan okipe GTAW ak vis vèrsa. Sepandan, li esansyèl pou tcheke si gen bon fil ak koneksyon, paske se pa tout machin GTAW ki pare pou soude baton. Ou pral tipikman jwenn machin GTAW nan de kategori: Kouran Dirèk (DC) sèlman oswa Kouran Altènatif / Kouran Dirèk (AC/DC). Pi machin AC GTAW yo eksepsyonèlman ra.
pt_br: Fonte de energia e tipo de máquina: GTAW opera com uma fonte de energia de corrente constante (CC), muito parecida com o processo de soldagem por arco metálico blindado (SMAW). Esta compatibilidade significa que uma máquina adequada para SMAW pode ser tecnicamente convertida para lidar com GTAW e vice-versa. No entanto, é essencial verificar os cabos e conexões corretos, pois nem todas as máquinas GTAW vêm prontas para soldagem eletromagnética. Normalmente, você encontrará máquinas GTAW em duas categorias: apenas corrente contínua (CC) ou corrente alternada/corrente contínua (CA/CC). Máquinas Pure AC GTAW são excepcionalmente raras.
zh_hans: 电源及机器类型： GTAW 采用恒流 (CC) 电源运行，与屏蔽金属电弧焊 (SMAW) 工艺非常相似。这种兼容性意味着适合 SMAW 的机器在技术上可以转换为处理 GTAW，反之亦然。然而，检查引线和连接是否正确非常重要，因为并非所有 GTAW 机器都可以进行焊条焊接。您通常会发现 GTAW 机器分为两类：纯直流电 (DC) 或交流电/直流电 (AC/DC)。纯交流 GTAW 机器极为罕见。

source: Practice
es_419: Práctica
fil_ph: Magsanay
ht: Pratike
pt_br: Prática
zh_hans: 实践

source: Press and hold on the task to delete when you are ready to trash it
es_419: Mantenga presionada la tarea para eliminarla cuando esté listo para eliminarla.
fil_ph: Pindutin nang matagal ang gawain upang tanggalin kapag handa ka nang itapon ito
ht: Peze epi kenbe sou travay la efase lè ou pare pou fatra li
pt_br: Pressione e segure a tarefa para excluí-la quando estiver pronto para descartá-la
zh_hans: 当您准备好将其删除时，按住要删除的任务

source: Priority
es_419: Prioridad
fil_ph: Priyoridad
ht: Priyorite
pt_br: Prioridade
zh_hans: 优先事项

source: Pure Tungsten recommended for X-ray quality welds with no radioactive inclusions. They are typically cheaper, have a lower current-carrying capacity, and lower resistance to weld contamination. Used with AC.
es_419: Tungsteno puro recomendado para soldaduras con calidad de rayos X y sin inclusiones radiactivas. Por lo general, son más baratos, tienen una menor capacidad de transporte de corriente y una menor resistencia a la contaminación de la soldadura. Usado con aire acondicionado.
fil_ph: Inirerekomenda ang Purong Tungsten para sa mga welds ng kalidad ng X-ray na walang mga radioactive inclusions. Karaniwang mas mura ang mga ito, may mas mababang kapasidad na nagdadala ng kasalukuyang, at mas mababang resistensya sa kontaminasyon ng weld. Ginamit sa AC.
ht: Pi Tungstène rekòmande pou soude bon jan kalite radyografi ki pa gen okenn enklizyon radyo-aktif. Yo tipikman pi bon mache, yo gen yon pi ba kapasite kouran-pote, ak pi ba rezistans nan kontaminasyon soude. Itilize ak AC.
pt_br: Tungstênio puro recomendado para soldas com qualidade de raios X sem inclusões radioativas. Eles são normalmente mais baratos, têm menor capacidade de transporte de corrente e menor resistência à contaminação da solda. Usado com AC.
zh_hans: 建议使用纯钨进行 X 射线质量焊接，不含放射性夹杂物。它们通常更便宜，载流能力较低，并且对焊接污染的抵抗力较低。与交流电一起使用。

source: Quick Checklist for Welders and Inspectors: 1. Visual Inspection: * Check for obvious defects such as cracks, porosity, undercutting, and incomplete fusion. * Ensure the weld size meets the specifications (width, length, and height). * Look for any surface irregularities like spatter, uneven bead profile, and misalignment. 2. Dimensional Checks: * Verify that the dimensions of the welded components align with the engineering drawings and specifications. * Measure the leg length and throat size of fillet welds. * Check the weld reinforcement and penetration depth for groove welds. 3. Non-Destructive Testing (NDT): * Employ methods like ultrasonic testing, radiographic testing, magnetic particle testing, and dye penetrant inspection to detect internal and surface defects. * Choose the NDT method based on the type of material, weld, and defects suspected. 4. Destructive Testing: * In some cases, carry out destructive tests like bend tests, tensile tests, and impact tests to evaluate the mechanical properties of the weld. * Use these tests primarily for procedure qualification and welder performance qualification. 5. Welder and Procedure Qualification: * Verify that the welders are qualified to perform the welding as per the required standards and procedures. * Ensure that the welding procedure specifications (WPS) are approved and followed during the welding process. 6. Material Verification: * Confirm that the materials used (base metals, filler metals, shielding gases) comply with the specifications and are appropriate for the welding process. 7. Welding Equipment and Settings: * Inspect welding equipment for proper function and calibration. * Ensure that the welding parameters (amperage, voltage, travel speed) adhere to the WPS. 8. Record Keeping and Documentation: * Maintain accurate records of inspections, tests, and certifications. * Document any non-conformities and ensure corrective actions are taken. * Confirm compliance with relevant codes, standards (like AWS, ASME), and legal requirements.
es_419: Lista de verificación rápida para soldadores e inspectores: 1. Inspección visual: * Compruebe si hay defectos obvios como grietas, porosidad, socavados y fusión incompleta. * Asegúrese de que el tamaño de la soldadura cumpla con las especificaciones (ancho, largo y alto). * Busque irregularidades en la superficie, como salpicaduras, perfil desigual del cordón y desalineación. 2. Comprobaciones dimensionales: * Verificar que las dimensiones de los componentes soldados se alineen con los dibujos y especificaciones de ingeniería. * Mida la longitud de la pierna y el tamaño de la garganta de las soldaduras de filete. * Verifique el refuerzo de soldadura y la profundidad de penetración para soldaduras de ranura. 3. Ensayos No Destructivos (END): * Emplear métodos como pruebas ultrasónicas, pruebas radiográficas, pruebas de partículas magnéticas e inspección con tintes penetrantes para detectar defectos internos y superficiales. * Elija el método END según el tipo de material, soldadura y defectos sospechados. 4. Pruebas destructivas: * En algunos casos, realizar pruebas destructivas como pruebas de flexión, pruebas de tracción y pruebas de impacto para evaluar las propiedades mecánicas de la soldadura. * Utilice estas pruebas principalmente para la calificación de procedimientos y la calificación del desempeño del soldador. 5. Calificación del Soldador y Procedimiento: * Verificar que los soldadores estén calificados para realizar la soldadura según las normas y procedimientos requeridos. * Asegurar que las especificaciones del procedimiento de soldadura (WPS) sean aprobadas y seguidas durante el proceso de soldadura. 6. Verificación de materiales: * Confirmar que los materiales utilizados (metales base, metales de aporte, gases de protección) cumplan con las especificaciones y sean apropiados para el proceso de soldadura. 7. Equipos y configuraciones de soldadura: * Inspecciona el equipo de soldadura para funcionamiento y calibración adecuados. * Asegúrese de que los parámetros de soldadura (amperaje, voltaje, velocidad de desplazamiento) se ajusten al WPS. 8. Mantenimiento de registros y documentación: * Mantener registros precisos de inspecciones, pruebas y certificaciones. * Documentar cualquier no conformidad y garantizar que se tomen acciones correctivas. * Confirmar el cumplimiento de los códigos, estándares (como AWS, ASME) y requisitos legales relevantes.
fil_ph: Mabilis na Checklist para sa mga Welder at Inspektor: 1. Visual na Inspeksyon: * Suriin kung may halatang mga depekto tulad ng mga bitak, porosity, undercutting, at hindi kumpletong pagsasanib. * Tiyaking ang laki ng weld ay nakakatugon sa mga detalye (lapad, haba, at taas). * Maghanap ng anumang mga iregularidad sa ibabaw tulad ng spatter, hindi pantay na profile ng bead, at misalignment. 2. Mga Dimensional na Pagsusuri: * I-verify na ang mga sukat ng mga welded na bahagi ay nakaayon sa mga guhit at detalye ng engineering. * Sukatin ang haba ng binti at laki ng lalamunan ng fillet welds. * Suriin ang weld reinforcement at penetration depth para sa mga groove welds. 3. Non-Destructive Testing (NDT): * Gumamit ng mga pamamaraan tulad ng ultrasonic testing, radiographic testing, magnetic particle testing, at dye penetrant inspection para makita ang mga internal at surface na depekto. * Piliin ang paraan ng NDT batay sa uri ng materyal, hinang, at pinaghihinalaang mga depekto. 4. Mapanirang Pagsubok: * Sa ilang mga kaso, magsagawa ng mga mapanirang pagsubok tulad ng mga pagsusuri sa liko, mga pagsubok sa tensile, at mga pagsubok sa epekto upang suriin ang mga mekanikal na katangian ng weld. * Gamitin ang mga pagsusulit na ito lalo na para sa kwalipikasyon ng pamamaraan at kwalipikasyon sa pagganap ng welder. 5. Kwalipikasyon ng Welder at Pamamaraan: * I-verify na ang mga welder ay kuwalipikadong magsagawa ng welding ayon sa mga kinakailangang pamantayan at pamamaraan. * Tiyakin na ang welding procedure specifications (WPS) ay naaprubahan at sinusunod sa panahon ng proseso ng welding. 6. Pagpapatunay ng Materyal: * Kumpirmahin na ang mga materyales na ginamit (base metals, filler metals, shielding gases) ay sumusunod sa mga detalye at angkop para sa proseso ng welding. 7. Welding Equipment at Settings: * Siyasatin ang mga kagamitan sa hinang para sa wastong paggana at pagkakalibrate. * Tiyakin na ang mga parameter ng welding (amperage, boltahe, bilis ng paglalakbay) ay sumunod sa WPS. 8. Pagpapanatili ng Record at Dokumentasyon: * Panatilihin ang tumpak na mga talaan ng mga inspeksyon, pagsusuri, at sertipikasyon. * Idokumento ang anumang mga hindi pagsang-ayon at tiyaking gagawin ang mga pagwawasto. * Kumpirmahin ang pagsunod sa mga nauugnay na code, pamantayan (tulad ng AWS, ASME), at mga legal na kinakailangan.
ht: Lis verifikasyon rapid pou soude ak enspektè: 1. Enspeksyon vizyèl: * Tcheke pou domaj evidan tankou fant, porosite, undercotting, ak fizyon enkonplè. * Asire gwosè soude a satisfè espesifikasyon yo (lajè, longè, ak wotè). * Chèche nenpòt iregilarite sifas tankou sal, pwofil chaplèt inegal, ak aliyman. 2. Verifikasyon dimansyon: * Verifye ke dimansyon yo nan eleman yo soude aliman ak desen yo jeni ak espesifikasyon. * Mezire longè janm ak gwosè gòj soude file. * Tcheke ranfòsman an soude ak pwofondè pénétration pou soude Groove. 3. Tès ki pa destriktif (NDT): * Anplwaye metòd tankou tès ultrasons, tès radyografi, tès patikil mayetik, ak enspeksyon penetran lank pou detekte domaj entèn ak sifas yo. * Chwazi metòd NDT ki baze sou kalite materyèl, soude, ak domaj yo sispèk. 4. Tès destriktif: * Nan kèk ka, fè tès destriktif tankou tès koube, tès rupture, ak tès enpak pou evalye pwopriyete mekanik soude a. * Sèvi ak tès sa yo prensipalman pou kalifikasyon pwosedi ak kalifikasyon pèfòmans soude. 5. Soudeur ak Pwosedi Kalifikasyon: * Verifye ke soudeur yo kalifye pou fè soude a dapre estanda ak pwosedi yo mande yo. * Asire ke espesifikasyon pwosedi soude yo (WPS) yo apwouve epi swiv pandan pwosesis la soude. 6. Verifikasyon materyèl: * Konfime ke materyèl yo itilize (metal debaz, metal ranpli, gaz pwoteksyon) konfòme yo ak espesifikasyon yo epi yo apwopriye pou pwosesis la soude. 7. Ekipman soude ak anviwònman: * Enspekte ekipman soude pou bon fonksyon ak kalibrasyon. * Asire ke paramèt soude yo (anperaj, vòltaj, vitès vwayaj) konfòme yo ak WPS la. 8. Konsèvasyon Dosye ak Dokimantasyon: * Kenbe dosye egzat sou enspeksyon, tès, ak sètifikasyon. * Dokimante nenpòt non-konfòmite epi asire aksyon korektif yo pran. * Konfime konfòmite ak kòd ki enpòtan, estanda (tankou AWS, ASME), ak kondisyon legal yo.
pt_br: Lista de verificação rápida para soldadores e inspetores: 1. Inspeção Visual: * Verifique se há defeitos óbvios, como rachaduras, porosidade, cortes inferiores e fusão incompleta. * Certifique-se de que o tamanho da solda atenda às especificações (largura, comprimento e altura). * Procure quaisquer irregularidades na superfície, como respingos, perfil irregular do cordão e desalinhamento. 2. Verificações dimensionais: * Verifique se as dimensões dos componentes soldados estão alinhadas com os desenhos e especificações de engenharia. * Meça o comprimento da perna e o tamanho da garganta das soldas de filete. * Verifique o reforço da solda e a profundidade de penetração das soldas em canal. 3. Ensaios Não Destrutivos (END): * Empregue métodos como testes ultrassônicos, testes radiográficos, testes de partículas magnéticas e inspeção de corante penetrante para detectar defeitos internos e superficiais. * Escolha o método END com base no tipo de material, solda e defeitos suspeitos. 4. Testes Destrutivos: * Em alguns casos, realize testes destrutivos como testes de flexão, testes de tração e testes de impacto para avaliar as propriedades mecânicas da solda. * Use esses testes principalmente para qualificação de procedimentos e qualificação de desempenho do soldador. 5. Qualificação do Soldador e Procedimento: * Verifique se os soldadores estão qualificados para realizar a soldagem de acordo com os padrões e procedimentos exigidos. * Certifique-se de que as especificações do procedimento de soldagem (WPS) sejam aprovadas e seguidas durante o processo de soldagem. 6. Verificação de Materiais: * Confirme se os materiais utilizados (metais básicos, metais de adição, gases de proteção) atendem às especificações e são apropriados para o processo de soldagem. 7. Equipamentos e configurações de soldagem: * Inspecione o equipamento de soldagem quanto ao funcionamento e calibração adequados. * Certifique-se de que os parâmetros de soldagem (amperagem, tensão, velocidade de deslocamento) estejam de acordo com o WPS. 8. Manutenção de registros e documentação: * Manter registros precisos de inspeções, testes e certificações. * Documente quaisquer não conformidades e garanta que ações corretivas sejam tomadas. * Confirme a conformidade com códigos, padrões relevantes (como AWS, ASME) e requisitos legais.
zh_hans: 焊工和检验员快速清单： 1.目视检查： * 检查是否有明显的缺陷，如裂纹、气孔、咬边、未熔合等。 * 确保焊缝尺寸符合规格（宽度、长度和高度）。 * 寻找任何表面不规则现象，例如飞溅、不均匀的焊道轮廓和错位。 2. 尺寸检查： * 验证焊接部件的尺寸是否符合工程图纸和规格。 * 测量角焊缝的焊脚长度和焊喉尺寸。 * 检查坡口焊缝的焊缝强化和熔深。 3. 无损检测（NDT）： * 采用超声波探伤、射线探伤、磁粉探伤、着色渗透探伤等方法检测内部和表面缺陷。 * 根据材料、焊缝和怀疑缺陷的类型选择无损检测方法。 4.破坏性测试： * 在某些情况下，进行破坏性试验，如弯曲试验、拉伸试验和冲击试验，以评估焊缝的机械性能。 * 这些测试主要用于程序鉴定和焊工性能鉴定。 5、焊工及工艺资格： * 验证焊工是否有资格按照要求的标准和程序进行焊接。 * 确保焊接工艺规范 (WPS) 得到批准并在焊接过程中遵循。 6. 材料验证： * 确认所使用的材料（母材、填充金属、保护气体）符合规格且适合焊接工艺。 7、焊接设备及设置： * 检查焊接设备的功能和校准是否正常。 * 确保焊接参数（电流强度、电压、行进速度）符合 WPS。 8. 记录保存和文件记录： * 保存检查、测试和认证的准确记录。 * 记录任何不符合项并确保采取纠正措施。 * 确认遵守相关规范、标准（例如 AWS、ASME）和法律要求。
